desafio17/analisis/artillery-info-log.txt
Phase started: unnamed (index: 0, duration: 1s) 18:24:37(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 18:24:38(-0300)

--------------------------------------
Metrics for period to: 18:24:40(-0300) (width: 1.043s)
--------------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 965/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 53
  median: ...................................................................... 8.9
  p95: ......................................................................... 21.1
  p99: ......................................................................... 37
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 49.9
  max: ......................................................................... 328.8
  median: ...................................................................... 214.9
  p95: ......................................................................... 308
  p99: ......................................................................... 320.6


All VUs finished. Total time: 3 seconds

--------------------------------
Summary report @ 18:24:41(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 965/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 53
  median: ...................................................................... 8.9
  p95: ......................................................................... 21.1
  p99: ......................................................................... 37
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 49.9
  max: ......................................................................... 328.8
  median: ...................................................................... 214.9
  p95: ......................................................................... 308
  p99: ......................................................................... 320.6